FV2310/E_0539.puml
@startuml
skinparam Shadowing false
skinparam NoteBorderColor #f3f1f6
skinparam NoteBackgroundColor #f3f1f6
skinparam NoteFontSize 12
skinparam ActivityBorderColor none
skinparam ActivityBackgroundColor #7a8da1
skinparam ActivityFontSize 16
skinparam ArrowColor #7aab8a
skinparam ArrowFontSize 16
skinparam ActivityDiamondBackgroundColor #7aab8a
skinparam ActivityDiamondBorderColor #7aab8a
skinparam ActivityDiamondFontSize 18
skinparam defaultFontName DejaVu Serif Condensed
skinparam ActivityEndColor #669580

header
<b>FV2210
2022-12-12
endheader

title
GPKE

6.38.10: AD Bestellung einer Konfiguration vom LF an MSB



end title
:<b>E_0539</b>;
note right
<b><i>Prüfende Rolle: MSB
end note

if (<b>15: </b> Wurden die Vorlauffristen eingehalten?
Hinweis: Es ist die maximale und die minimale Vorlauffrist zu prüfen.) then (ja)
else (nein)
    :A04;
    note left
        Cluster: Ablehnung
        Die Vorlauffrist wurde nicht eingehalten.
    endnote
    kill;
endif
if (<b>20: </b> Handelt es sich um eine kostenpflichtige Bestellung?) then (ja)
else (nein)
    if (<b>30: </b> Handelt es sich um eine Bestellung, die beendet werden kann?) then (ja)
    else (nein)
        :A02;
        note left
            Cluster: Ablehnung
            Es handelt sich um eine Bestellung, die nicht beendet werden kann.
        endnote
        kill;
    endif
    if (<b>40: </b> Ist ein zuvor nicht spezifizierter Fehler aufgetreten?) then (ja)
        :A99;
        note left
            Cluster: Ablehnung
            Sonstiges
            Hinweis: Das identifizierte Problem ist in der Antwort zu beschreiben/benennen.
            Nutzungsmöglichkeit Ende: 01.10.2024 00:00 Uhr
        endnote
        kill;
    else (nein)
        :A03;
        note left
            Cluster: Zustimmung
            Bestätigung der Beendigung
        endnote
        kill;
    endif
endif
if (<b>40: </b> Ist ein zuvor nicht spezifizierter Fehler aufgetreten?) then (ja)
    :A99;
    note left
        Cluster: Ablehnung
        Sonstiges
        Hinweis: Das identifizierte Problem ist in der Antwort zu beschreiben/benennen.
        Nutzungsmöglichkeit Ende: 01.10.2024 00:00 Uhr
    endnote
    kill;
else (nein)
    :A03;
    note left
        Cluster: Zustimmung
        Bestätigung der Beendigung
    endnote
    kill;
endif

@enduml
